//! # 算法分类
//! 十种常见排序算法可以分为两大类：
//! - 比较类排序：通过比较来决定元素间的相对次序，由于其时间复杂度不能突破O(nlogn)，因此也称为非线性时间比较类排序。
//! - 非比较类排序：不通过比较来决定元素间的相对次序，它可以突破基于比较排序的时间下界，以线性时间运行，因此也称为线性时间非比较类排序。
//! ## 比较类排序
//! 1. 交换排序
//!     - 冒泡排序 O(n^2)
//!     - 快速排序 O(nlog2^n)
//! 2. 插入排序
//!     - 简单插入排序 O(n^2)
//!     - 希尔排序 O(n^1.3)
//! 3. 选择排序
//!     - 简单选择排序 O(n^2)
//!     - 堆排序 O(nlog2^n)
//! 4. 归并排序 O(nlog2^n)
//!     - 二路归并排序
//!     - 多路归并排序
//! ## 非比较类排序
//! 1. 计数排序 O(n+k)
//! 2. 桶排序 O(n+k)
//! 3. 基数排序 O(n*k)
//! ```txt
//! @author:syf20020816@Outlook.com
//! @date:2023/9/9
//! @version:0.0.1
//! @description:
//! ```


///冒泡排序
mod bubble_sort;
///归并排序
mod merge_sort;
/// 选择排序
mod select_sort;
/// 插入排序
mod insert_sort;
